app/controllers/issues_controller.rb

  def index
    @issues = Issue.all
---
SELECT "issues".* FROM "issues"

  def show
    id = session[:user_id]
    @issues = User.find(id).issues
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @user = User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @user = User.find(session[:id])
    @issue = Issue.new(issue_params)
    if @issue.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "issues" ("name", "address", "detail", "user_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "other than"], ["address", "123hhhhh"], ["detail", "sdsadas"], ["user_id", 7], ["owner_id", 1], ["created_at", "2017-10-28 22:32:27.369441"], ["updated_at", "2017-10-28 22:32:27.369441"]]