app/controllers/owners_controller.rb

SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @owner = Owner.find(id)