app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @user = User.find(id)

SELECT "owners".* FROM "owners"
---
  def new
    @owners = Owner.all

SELECT  "owners".* FROM "owners" WHERE "owners"."firstname" = ? LIMIT ?  [["firstname", "Joe"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "firstname", "lastname", "address", "password_digest", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    params[:user][:owner_id] = Owner.find_by(firstname: params[:user][:owner_id].split(" ")[0]).id
    @user = User.new(user_params)
    if @user.save