app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "LordMikeAng"], ["LIMIT", 1]]
SELECT  "owners".* FROM "owners" WHERE "owners"."username" = ? LIMIT ?  [["username", "LordMikeAng"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(username: params[:username])
    @owner = Owner.find_by(username: params[:username])